## Terraform TFPlan Output for `ec2-instance`
  

```hcl
[command]/home/runner/work/_temp/9a854a6f-50ff-4151-a148-031bdaa3041b/terraform-bin plan
[0m[1mdata.aws_ami.amazon_linux: Reading...[0m[0m
[0m[1mdata.aws_ami.amazon_linux: Read complete after 0s [id=ami-0c6ebb5b9bce4ba15][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_iam_instance_profile.ec2_profile[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ec2_profile" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m create_date = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "ec2_instance_profile"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m role        = "ec2_role"
      [32m+[0m[0m tags_all    = (known after apply)
      [32m+[0m[0m unique_id   = (known after apply)
    }

[1m  # aws_iam_role.ec2[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ec2" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "ec2_role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_instance.krishna-tf-ec2instance[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "krishna-tf-ec2instance" {
      [32m+[0m[0m ami                                  = "ami-0c6ebb5b9bce4ba15"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = (known after apply)
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = "ec2_instance_profile"
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = (known after apply)
      [32m+[0m[0m monitoring                           = (known after apply)
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = (known after apply)
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Creator" = "Krishna"
          [32m+[0m[0m "Name"    = "EC2Instance"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Creator" = "Krishna"
          [32m+[0m[0m "Name"    = "EC2Instance"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = (known after apply)

      [32m+[0m[0m capacity_reservation_specification (known after apply)

      [32m+[0m[0m cpu_options (known after apply)

      [32m+[0m[0m ebs_block_device (known after apply)

      [32m+[0m[0m enclave_options (known after apply)

      [32m+[0m[0m ephemeral_block_device (known after apply)

      [32m+[0m[0m instance_market_options (known after apply)

      [32m+[0m[0m maintenance_options (known after apply)

      [32m+[0m[0m metadata_options (known after apply)

      [32m+[0m[0m network_interface (known after apply)

      [32m+[0m[0m private_dns_name_options (known after apply)

      [32m+[0m[0m root_block_device (known after apply)
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m ec2_instance_arn = (known after apply)
  [32m+[0m[0m ec2_role_arn     = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: [0m[1mdata.aws_ami.amazon_linux: Reading...[0m[0m%0A[0m[1mdata.aws_ami.amazon_linux: Read complete after 0s [id=ami-0c6ebb5b9bce4ba15][0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_iam_instance_profile.ec2_profile[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ec2_profile" {%0A      [32m+[0m[0m arn         = (known after apply)%0A      [32m+[0m[0m create_date = (known after apply)%0A      [32m+[0m[0m id          = (known after apply)%0A      [32m+[0m[0m name        = "ec2_instance_profile"%0A      [32m+[0m[0m name_prefix = (known after apply)%0A      [32m+[0m[0m path        = "/"%0A      [32m+[0m[0m role        = "ec2_role"%0A      [32m+[0m[0m tags_all    = (known after apply)%0A      [32m+[0m[0m unique_id   = (known after apply)%0A    }%0A%0A[1m  # aws_iam_role.ec2[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role" "ec2" {%0A      [32m+[0m[0m arn                   = (known after apply)%0A      [32m+[0m[0m assume_role_policy    = jsonencode(%0A            {%0A              [32m+[0m[0m Statement = [%0A                  [32m+[0m[0m {%0A                      [32m+[0m[0m Action    = "sts:AssumeRole"%0A                      [32m+[0m[0m Effect    = "Allow"%0A                      [32m+[0m[0m Principal = {%0A                          [32m+[0m[0m Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              [32m+[0m[0m Version   = "2012-10-17"%0A            }%0A        )%0A      [32m+[0m[0m create_date           = (known after apply)%0A      [32m+[0m[0m force_detach_policies = false%0A      [32m+[0m[0m id                    = (known after apply)%0A      [32m+[0m[0m managed_policy_arns   = (known after apply)%0A      [32m+[0m[0m max_session_duration  = 3600%0A      [32m+[0m[0m name                  = "ec2_role"%0A      [32m+[0m[0m name_prefix           = (known after apply)%0A      [32m+[0m[0m path                  = "/"%0A      [32m+[0m[0m tags_all              = (known after apply)%0A      [32m+[0m[0m unique_id             = (known after apply)%0A%0A      [32m+[0m[0m inline_policy (known after apply)%0A    }%0A%0A[1m  # aws_instance.krishna-tf-ec2instance[0m will be created%0A[0m  [32m+[0m[0m resource "aws_instance" "krishna-tf-ec2instance" {%0A      [32m+[0m[0m ami                                  = "ami-0c6ebb5b9bce4ba15"%0A      [32m+[0m[0m arn                                  = (known after apply)%0A      [32m+[0m[0m associate_public_ip_address          = (known after apply)%0A      [32m+[0m[0m availability_zone                    = (known after apply)%0A      [32m+[0m[0m cpu_core_count                       = (known after apply)%0A      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)%0A      [32m+[0m[0m disable_api_stop                     = (known after apply)%0A      [32m+[0m[0m disable_api_termination              = (known after apply)%0A      [32m+[0m[0m ebs_optimized                        = (known after apply)%0A      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)%0A      [32m+[0m[0m get_password_data                    = false%0A      [32m+[0m[0m host_id                              = (known after apply)%0A      [32m+[0m[0m host_resource_group_arn              = (known after apply)%0A      [32m+[0m[0m iam_instance_profile                 = "ec2_instance_profile"%0A      [32m+[0m[0m id                                   = (known after apply)%0A      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)%0A      [32m+[0m[0m instance_lifecycle                   = (known after apply)%0A      [32m+[0m[0m instance_state                       = (known after apply)%0A      [32m+[0m[0m instance_type                        = "t2.micro"%0A      [32m+[0m[0m ipv6_address_count                   = (known after apply)%0A      [32m+[0m[0m ipv6_addresses                       = (known after apply)%0A      [32m+[0m[0m key_name                             = (known after apply)%0A      [32m+[0m[0m monitoring                           = (known after apply)%0A      [32m+[0m[0m outpost_arn                          = (known after apply)%0A      [32m+[0m[0m password_data                        = (known after apply)%0A      [32m+[0m[0m placement_group                      = (known after apply)%0A      [32m+[0m[0m placement_partition_number           = (known after apply)%0A      [32m+[0m[0m primary_network_interface_id         = (known after apply)%0A      [32m+[0m[0m private_dns                          = (known after apply)%0A      [32m+[0m[0m private_ip                           = (known after apply)%0A      [32m+[0m[0m public_dns                           = (known after apply)%0A      [32m+[0m[0m public_ip                            = (known after apply)%0A      [32m+[0m[0m secondary_private_ips                = (known after apply)%0A      [32m+[0m[0m security_groups                      = (known after apply)%0A      [32m+[0m[0m source_dest_check                    = true%0A      [32m+[0m[0m spot_instance_request_id             = (known after apply)%0A      [32m+[0m[0m subnet_id                            = (known after apply)%0A      [32m+[0m[0m tags                                 = {%0A          [32m+[0m[0m "Creator" = "Krishna"%0A          [32m+[0m[0m "Name"    = "EC2Instance"%0A        }%0A      [32m+[0m[0m tags_all                             = {%0A          [32m+[0m[0m "Creator" = "Krishna"%0A          [32m+[0m[0m "Name"    = "EC2Instance"%0A        }%0A      [32m+[0m[0m tenancy                              = (known after apply)%0A      [32m+[0m[0m user_data                            = (known after apply)%0A      [32m+[0m[0m user_data_base64                     = (known after apply)%0A      [32m+[0m[0m user_data_replace_on_change          = false%0A      [32m+[0m[0m vpc_security_group_ids               = (known after apply)%0A%0A      [32m+[0m[0m capacity_reservation_specification (known after apply)%0A%0A      [32m+[0m[0m cpu_options (known after apply)%0A%0A      [32m+[0m[0m ebs_block_device (known after apply)%0A%0A      [32m+[0m[0m enclave_options (known after apply)%0A%0A      [32m+[0m[0m ephemeral_block_device (known after apply)%0A%0A      [32m+[0m[0m instance_market_options (known after apply)%0A%0A      [32m+[0m[0m maintenance_options (known after apply)%0A%0A      [32m+[0m[0m metadata_options (known after apply)%0A%0A      [32m+[0m[0m network_interface (known after apply)%0A%0A      [32m+[0m[0m private_dns_name_options (known after apply)%0A%0A      [32m+[0m[0m root_block_device (known after apply)%0A    }%0A%0A[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m ec2_instance_arn = (known after apply)%0A  [32m+[0m[0m ec2_role_arn     = (known after apply)%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::[0m[1mdata.aws_ami.amazon_linux: Reading...[0m[0m%0A[0m[1mdata.aws_ami.amazon_linux: Read complete after 0s [id=ami-0c6ebb5b9bce4ba15][0m%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_iam_instance_profile.ec2_profile[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_instance_profile" "ec2_profile" {%0A      [32m+[0m[0m arn         = (known after apply)%0A      [32m+[0m[0m create_date = (known after apply)%0A      [32m+[0m[0m id          = (known after apply)%0A      [32m+[0m[0m name        = "ec2_instance_profile"%0A      [32m+[0m[0m name_prefix = (known after apply)%0A      [32m+[0m[0m path        = "/"%0A      [32m+[0m[0m role        = "ec2_role"%0A      [32m+[0m[0m tags_all    = (known after apply)%0A      [32m+[0m[0m unique_id   = (known after apply)%0A    }%0A%0A[1m  # aws_iam_role.ec2[0m will be created%0A[0m  [32m+[0m[0m resource "aws_iam_role" "ec2" {%0A      [32m+[0m[0m arn                   = (known after apply)%0A      [32m+[0m[0m assume_role_policy    = jsonencode(%0A            {%0A              [32m+[0m[0m Statement = [%0A                  [32m+[0m[0m {%0A                      [32m+[0m[0m Action    = "sts:AssumeRole"%0A                      [32m+[0m[0m Effect    = "Allow"%0A                      [32m+[0m[0m Principal = {%0A                          [32m+[0m[0m Service = "ec2.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              [32m+[0m[0m Version   = "2012-10-17"%0A            }%0A        )%0A      [32m+[0m[0m create_date           = (known after apply)%0A      [32m+[0m[0m force_detach_policies = false%0A      [32m+[0m[0m id                    = (known after apply)%0A      [32m+[0m[0m managed_policy_arns   = (known after apply)%0A      [32m+[0m[0m max_session_duration  = 3600%0A      [32m+[0m[0m name                  = "ec2_role"%0A      [32m+[0m[0m name_prefix           = (known after apply)%0A      [32m+[0m[0m path                  = "/"%0A      [32m+[0m[0m tags_all              = (known after apply)%0A      [32m+[0m[0m unique_id             = (known after apply)%0A%0A      [32m+[0m[0m inline_policy (known after apply)%0A    }%0A%0A[1m  # aws_instance.krishna-tf-ec2instance[0m will be created%0A[0m  [32m+[0m[0m resource "aws_instance" "krishna-tf-ec2instance" {%0A      [32m+[0m[0m ami                                  = "ami-0c6ebb5b9bce4ba15"%0A      [32m+[0m[0m arn                                  = (known after apply)%0A      [32m+[0m[0m associate_public_ip_address          = (known after apply)%0A      [32m+[0m[0m availability_zone                    = (known after apply)%0A      [32m+[0m[0m cpu_core_count                       = (known after apply)%0A      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)%0A      [32m+[0m[0m disable_api_stop                     = (known after apply)%0A      [32m+[0m[0m disable_api_termination              = (known after apply)%0A      [32m+[0m[0m ebs_optimized                        = (known after apply)%0A      [32m+[0m[0m enable_primary_ipv6                  = (known after apply)%0A      [32m+[0m[0m get_password_data                    = false%0A      [32m+[0m[0m host_id                              = (known after apply)%0A      [32m+[0m[0m host_resource_group_arn              = (known after apply)%0A      [32m+[0m[0m iam_instance_profile                 = "ec2_instance_profile"%0A      [32m+[0m[0m id                                   = (known after apply)%0A      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)%0A      [32m+[0m[0m instance_lifecycle                   = (known after apply)%0A      [32m+[0m[0m instance_state                       = (known after apply)%0A      [32m+[0m[0m instance_type                        = "t2.micro"%0A      [32m+[0m[0m ipv6_address_count                   = (known after apply)%0A      [32m+[0m[0m ipv6_addresses                       = (known after apply)%0A      [32m+[0m[0m key_name                             = (known after apply)%0A      [32m+[0m[0m monitoring                           = (known after apply)%0A      [32m+[0m[0m outpost_arn                          = (known after apply)%0A      [32m+[0m[0m password_data                        = (known after apply)%0A      [32m+[0m[0m placement_group                      = (known after apply)%0A      [32m+[0m[0m placement_partition_number           = (known after apply)%0A      [32m+[0m[0m primary_network_interface_id         = (known after apply)%0A      [32m+[0m[0m private_dns                          = (known after apply)%0A      [32m+[0m[0m private_ip                           = (known after apply)%0A      [32m+[0m[0m public_dns                           = (known after apply)%0A      [32m+[0m[0m public_ip                            = (known after apply)%0A      [32m+[0m[0m secondary_private_ips                = (known after apply)%0A      [32m+[0m[0m security_groups                      = (known after apply)%0A      [32m+[0m[0m source_dest_check                    = true%0A      [32m+[0m[0m spot_instance_request_id             = (known after apply)%0A      [32m+[0m[0m subnet_id                            = (known after apply)%0A      [32m+[0m[0m tags                                 = {%0A          [32m+[0m[0m "Creator" = "Krishna"%0A          [32m+[0m[0m "Name"    = "EC2Instance"%0A        }%0A      [32m+[0m[0m tags_all                             = {%0A          [32m+[0m[0m "Creator" = "Krishna"%0A          [32m+[0m[0m "Name"    = "EC2Instance"%0A        }%0A      [32m+[0m[0m tenancy                              = (known after apply)%0A      [32m+[0m[0m user_data                            = (known after apply)%0A      [32m+[0m[0m user_data_base64                     = (known after apply)%0A      [32m+[0m[0m user_data_replace_on_change          = false%0A      [32m+[0m[0m vpc_security_group_ids               = (known after apply)%0A%0A      [32m+[0m[0m capacity_reservation_specification (known after apply)%0A%0A      [32m+[0m[0m cpu_options (known after apply)%0A%0A      [32m+[0m[0m ebs_block_device (known after apply)%0A%0A      [32m+[0m[0m enclave_options (known after apply)%0A%0A      [32m+[0m[0m ephemeral_block_device (known after apply)%0A%0A      [32m+[0m[0m instance_market_options (known after apply)%0A%0A      [32m+[0m[0m maintenance_options (known after apply)%0A%0A      [32m+[0m[0m metadata_options (known after apply)%0A%0A      [32m+[0m[0m network_interface (known after apply)%0A%0A      [32m+[0m[0m private_dns_name_options (known after apply)%0A%0A      [32m+[0m[0m root_block_device (known after apply)%0A    }%0A%0A[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.%0A[0m%0AChanges to Outputs:%0A  [32m+[0m[0m ec2_instance_arn = (known after apply)%0A  [32m+[0m[0m ec2_role_arn     = (known after apply)%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```